cats_99/app/controllers/cats_controller.rb

  def index
    @kitties = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @kitty = Cat.new(cat_params)

    if @kitty.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @kitty = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @kitty = Cat.find_by(id: params[:id])

    if @kitty.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "I love pizza"], ["updated_at", "2019-04-02 23:29:48.198124"], ["id", 3]]